plcexpert/plc-x-arduino-hardware/avr/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

###################   ATMEL AVR   ##################################
menu.module=Product
PLCGENERICAVR.name= PLC-EXPERT (CPUs)
PLCAVR.name= PLC-EXPERT (Products)

PLCGENERICAVR.bootloader.tool=avrdude
PLCGENERICAVR.build.core=arduino
PLCGENERICAVR.build.board=AVR_UNO
PLCGENERICAVR.upload.tool=avrdude
PLCGENERICAVR.upload.protocol=arduino

PLCAVR.bootloader.tool=avrdude
PLCAVR.build.core=arduino
PLCAVR.build.board=AVR_UNO
PLCAVR.upload.tool=avrdude
PLCAVR.upload.protocol=arduino

## Atmel 328P
## -------------------------------------------------
PLCGENERICAVR.menu.module.ATMEL328P_8MHZ= Atmel Mega328P (8Mhz)
PLCGENERICAVR.menu.module.ATMEL328P_8MHZ.bootloader.high_fuses=0xDE
PLCGENERICAVR.menu.module.ATMEL328P_8MHZ.bootloader.low_fuses=0xFF
PLCGENERICAVR.menu.module.ATMEL328P_8MHZ.bootloader.extended_fuses=0xFD
PLCGENERICAVR.menu.module.ATMEL328P_8MHZ.bootloader.unlock_bits=0xFF
PLCGENERICAVR.menu.module.ATMEL328P_8MHZ.bootloader.lock_bits=0xCF
PLCGENERICAVR.menu.module.ATMEL328P_8MHZ.bootloader.file=ATmegaBOOT_168_atmega328_pro_8MHz.hex

PLCGENERICAVR.menu.module.ATMEL328P_8MHZ.build.mcu=atmega328p
PLCGENERICAVR.menu.module.ATMEL328P_8MHZ.build.f_cpu=8000000L
PLCGENERICAVR.menu.module.ATMEL328P_8MHZ.build.variant=atmega328p
PLCGENERICAVR.menu.module.ATMEL328P_8MHZ.build.board=AVR_UNO

PLCGENERICAVR.menu.module.ATMEL328P_8MHZ.upload.maximum_size=32256
PLCGENERICAVR.menu.module.ATMEL328P_8MHZ.upload.maximum_data_size=2048
PLCGENERICAVR.menu.module.ATMEL328P_8MHZ.upload.speed=57600

## Atmel 328P
## -------------------------------------------------
PLCGENERICAVR.menu.module.ATMEL328P_16MHZ= Atmel Mega328P (16Mhz)

PLCGENERICAVR.menu.module.ATMEL328P_16MHZ.bootloader.high_fuses=0xDE
PLCGENERICAVR.menu.module.ATMEL328P_16MHZ.bootloader.low_fuses=0xFF
PLCGENERICAVR.menu.module.ATMEL328P_16MHZ.bootloader.extended_fuses=0xFD
PLCGENERICAVR.menu.module.ATMEL328P_16MHZ.bootloader.unlock_bits=0xFF
PLCGENERICAVR.menu.module.ATMEL328P_16MHZ.bootloader.lock_bits=0xCF
PLCGENERICAVR.menu.module.ATMEL328P_16MHZ.bootloader.file=ATmegaBOOT_168_atmega328.hex

PLCGENERICAVR.menu.module.ATMEL328P_16MHZ.build.mcu=atmega328p
PLCGENERICAVR.menu.module.ATMEL328P_16MHZ.build.f_cpu=16000000L
PLCGENERICAVR.menu.module.ATMEL328P_16MHZ.build.variant=atmega328p
PLCGENERICAVR.menu.module.ATMEL328P_16MHZ.build.board=AVR_UNO

PLCGENERICAVR.menu.module.ATMEL328P_16MHZ.upload.maximum_size=32256
PLCGENERICAVR.menu.module.ATMEL328P_16MHZ.upload.maximum_data_size=2048
PLCGENERICAVR.menu.module.ATMEL328P_16MHZ.upload.speed=57600

## Atmel 328P
## -------------------------------------------------
PLCGENERICAVR.menu.module.ATMEL328P_20MHZ= Atmel Mega328P (20Mhz)

PLCGENERICAVR.menu.module.ATMEL328P_20MHZ.bootloader.high_fuses=0xDE
PLCGENERICAVR.menu.module.ATMEL328P_20MHZ.bootloader.low_fuses=0xFF
PLCGENERICAVR.menu.module.ATMEL328P_20MHZ.bootloader.extended_fuses=0xFD
PLCGENERICAVR.menu.module.ATMEL328P_20MHZ.bootloader.unlock_bits=0xFF
PLCGENERICAVR.menu.module.ATMEL328P_20MHZ.bootloader.lock_bits=0xCF
PLCGENERICAVR.menu.module.ATMEL328P_20MHZ.bootloader.file=ATmegaBOOT_168_atmega328.hex

PLCGENERICAVR.menu.module.ATMEL328P_20MHZ.build.mcu=atmega328p
PLCGENERICAVR.menu.module.ATMEL328P_20MHZ.build.f_cpu=20000000L
PLCGENERICAVR.menu.module.ATMEL328P_20MHZ.build.variant=atmega328p
PLCGENERICAVR.menu.module.ATMEL328P_20MHZ.build.board=AVR_UNO

PLCGENERICAVR.menu.module.ATMEL328P_20MHZ.upload.maximum_size=32256
PLCGENERICAVR.menu.module.ATMEL328P_20MHZ.upload.maximum_data_size=2048
PLCGENERICAVR.menu.module.ATMEL328P_20MHZ.upload.speed=57600

## Atmel 328PB
## -------------------------------------------------
PLCGENERICAVR.menu.module.ATMEL328PB_8MHZ= Atmel Mega328PB (8Mhz)

PLCGENERICAVR.menu.module.ATMEL328PB_8MHZ.bootloader.high_fuses=0xDE
PLCGENERICAVR.menu.module.ATMEL328PB_8MHZ.bootloader.low_fuses=0xFF
PLCGENERICAVR.menu.module.ATMEL328PB_8MHZ.bootloader.extended_fuses=0xFD
PLCGENERICAVR.menu.module.ATMEL328PB_8MHZ.bootloader.unlock_bits=0xFF
PLCGENERICAVR.menu.module.ATMEL328PB_8MHZ.bootloader.lock_bits=0xCF
PLCGENERICAVR.menu.module.ATMEL328PB_8MHZ.bootloader.file=optiboot_m328pb.hex

PLCGENERICAVR.menu.module.ATMEL328PB_8MHZ.build.mcu=ATmega328PB
PLCGENERICAVR.menu.module.ATMEL328PB_8MHZ.build.f_cpu=8000000L
PLCGENERICAVR.menu.module.ATMEL328PB_8MHZ.build.variant=atmega328pb
PLCGENERICAVR.menu.module.ATMEL328PB_8MHZ.build.board=AVR_UNO

PLCGENERICAVR.menu.module.ATMEL328PB_8MHZ.upload.maximum_size=32256
PLCGENERICAVR.menu.module.ATMEL328PB_8MHZ.upload.maximum_data_size=2048
PLCGENERICAVR.menu.module.ATMEL328PB_8MHZ.upload.speed=57600

## Atmel 328PB
## -------------------------------------------------
PLCGENERICAVR.menu.module.ATMEL328PB_16MHZ= Atmel Mega328PB (16Mhz)

PLCGENERICAVR.menu.module.ATMEL328PB_16MHZ.bootloader.high_fuses=0xDE
PLCGENERICAVR.menu.module.ATMEL328PB_16MHZ.bootloader.low_fuses=0xFF
PLCGENERICAVR.menu.module.ATMEL328PB_16MHZ.bootloader.extended_fuses=0xFD
PLCGENERICAVR.menu.module.ATMEL328PB_16MHZ.bootloader.unlock_bits=0xFF
PLCGENERICAVR.menu.module.ATMEL328PB_16MHZ.bootloader.lock_bits=0xCF
PLCGENERICAVR.menu.module.ATMEL328PB_16MHZ.bootloader.file=optiboot_m328pb.hex

PLCGENERICAVR.menu.module.ATMEL328PB_16MHZ.build.mcu=ATmega328PB
PLCGENERICAVR.menu.module.ATMEL328PB_16MHZ.build.f_cpu=16000000L
PLCGENERICAVR.menu.module.ATMEL328PB_16MHZ.build.variant=atmega328pb
PLCGENERICAVR.menu.module.ATMEL328PB_16MHZ.build.board=AVR_UNO

PLCGENERICAVR.menu.module.ATMEL328PB_16MHZ.upload.maximum_size=32256
PLCGENERICAVR.menu.module.ATMEL328PB_16MHZ.upload.maximum_data_size=2048
PLCGENERICAVR.menu.module.ATMEL328PB_16MHZ.upload.speed=57600

## Atmel 328PB
## -------------------------------------------------
PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ= Atmel Mega328PB (20Mhz)

PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.bootloader.high_fuses=0xDE
PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.bootloader.low_fuses=0xFF
PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.bootloader.extended_fuses=0xFD
PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.bootloader.unlock_bits=0xFF
PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.bootloader.lock_bits=0xCF
PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.bootloader.file=optiboot_m328pb.hex

