plcexpert/plc-x-arduino-hardware/avr/boards.txt
PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.build.mcu=ATmega328PB
PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.build.f_cpu=20000000L
PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.build.variant=atmega328pb
PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.build.board=AVR_UNO

PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.upload.maximum_size=32256
PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.upload.maximum_data_size=2048
PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.upload.speed=57600

## AT TINY85
## -------------------------------------------------
PLCGENERICAVR.menu.module.ATTINY85= AtTiny85 (internal 16Mhz)

PLCGENERICAVR.menu.module.ATTINY85.bootloader.high_fuses=0xDF
PLCGENERICAVR.menu.module.ATTINY85.bootloader.low_fuses=0xF1
PLCGENERICAVR.menu.module.ATTINY85.bootloader.extended_fuses=0xFF
PLCGENERICAVR.menu.module.ATTINY85.bootloader.unlock_bits=0xFF
PLCGENERICAVR.menu.module.ATTINY85.bootloader.lock_bits=0xFF
PLCGENERICAVR.menu.module.ATTINY85.bootloader.file=attiny85.hex
PLCGENERICAVR.menu.module.ATTINY85.bootloader.tool=arduino:avrdude

PLCGENERICAVR.menu.module.ATTINY85.build.core=arduino:arduino
PLCGENERICAVR.menu.module.ATTINY85.build.mcu=attiny85
PLCGENERICAVR.menu.module.ATTINY85.build.f_cpu=16000000L
PLCGENERICAVR.menu.module.ATTINY85.build.variant=tiny85
PLCGENERICAVR.menu.module.ATTINY85.build.board=attiny

PLCGENERICAVR.menu.module.ATTINY85.upload.maximum_size=8192
PLCGENERICAVR.menu.module.ATTINY85.upload.maximum_data_size=512
PLCGENERICAVR.menu.module.ATTINY85.upload.tool=arduino:avrdude

## AT MEGA2560
## -------------------------------------------------
PLCGENERICAVR.menu.module.MEGA2560_16MHZ= Atmel Mega2560 (16Mhz)

PLCGENERICAVR.menu.module.MEGA2560_16MHZ.bootloader.tool=avrdude
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.bootloader.low_fuses=0xFF
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.bootloader.unlock_bits=0x3F
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.bootloader.lock_bits=0x0F
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.bootloader.high_fuses=0xD8
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.bootloader.extended_fuses=0xFD
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.bootloader.file=stk500boot_v2_mega2560.hex

PLCGENERICAVR.menu.module.MEGA2560_16MHZ.build.f_cpu=16000000L
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.build.core=arduino
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.build.variant=mega
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.build.board=AVR_MEGA2560
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.build.mcu=atmega2560

PLCGENERICAVR.menu.module.MEGA2560_16MHZ.upload.maximum_data_size=8192
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.upload.protocol=wiring
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.upload.maximum_size=253952
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.upload.speed=115200

PLCGENERICAVR.menu.module.MEGA2560_16MHZ.vid.0=0x2341
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.pid.0=0x0010
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.vid.1=0x2341
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.pid.1=0x0042
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.vid.2=0x2A03
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.pid.2=0x0010
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.vid.3=0x2A03
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.pid.3=0x0042
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.vid.4=0x2341
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.pid.4=0x0210
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.vid.5=0x2341
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.pid.5=0x0242

## AT MEGA2560
## -------------------------------------------------
PLCGENERICAVR.menu.module.MEGA2560_20MHZ= Atmel Mega2560 (20Mhz)

PLCGENERICAVR.menu.module.MEGA2560_20MHZ.bootloader.tool=avrdude
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.bootloader.low_fuses=0xFF
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.bootloader.unlock_bits=0x3F
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.bootloader.lock_bits=0x0F
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.bootloader.high_fuses=0xD8
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.bootloader.extended_fuses=0xFD
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.bootloader.file=stk500boot_v2_mega2560.hex

PLCGENERICAVR.menu.module.MEGA2560_20MHZ.build.f_cpu=20000000L
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.build.core=arduino
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.build.variant=mega
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.build.board=AVR_MEGA2560
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.build.mcu=atmega2560

PLCGENERICAVR.menu.module.MEGA2560_20MHZ.upload.maximum_data_size=8192
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.upload.protocol=wiring
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.upload.maximum_size=253952
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.upload.speed=115200

PLCGENERICAVR.menu.module.MEGA2560_20MHZ.vid.0=0x2341
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.pid.0=0x0010
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.vid.1=0x2341
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.pid.1=0x0042
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.vid.2=0x2A03
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.pid.2=0x0010
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.vid.3=0x2A03
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.pid.3=0x0042
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.vid.4=0x2341
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.pid.4=0x0210
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.vid.5=0x2341
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.pid.5=0x0242


## -------------------- PRODUCTS --------------------

## DIO - Digital Input/Ouput Arduino UNO shield
## -------------------------------------------------
PLCAVR.menu.module.DIO13=PLC-DIO 1.3 (Arduino UNO shield)

PLCAVR.menu.module.DIO13.bootloader.high_fuses=0xDE
PLCAVR.menu.module.DIO13.bootloader.low_fuses=0xFF
PLCAVR.menu.module.DIO13.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.DIO13.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.DIO13.bootloader.lock_bits=0xCF
PLCAVR.menu.module.DIO13.bootloader.file=ATmegaBOOT_168_atmega328.hex

PLCAVR.menu.module.DIO13.build.mcu=atmega328p
PLCAVR.menu.module.DIO13.build.f_cpu=16000000L
PLCAVR.menu.module.DIO13.build.variant=atmega328p
PLCAVR.menu.module.DIO13.build.board=AVR_UNO

PLCAVR.menu.module.DIO13.upload.maximum_size=32256
PLCAVR.menu.module.DIO13.upload.maximum_data_size=2048
PLCAVR.menu.module.DIO13.upload.speed=57600

## DIO - Digital Input/Ouput Arduino NANO shield 
## -------------------------------------------------
PLCAVR.menu.module.DIO14=PLC-DIO 1.4 (Arduino NANO shield)

